<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Python_Data_Analytics_Course/blob/main/4_Problems/2_04_Pandas Pivot Tables.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

In [1]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt  

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

c:\Users\alexm\anaconda3\envs\python_course\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

## üü© Count Job Postings by Title and Country (2.4.1)

In [7]:
df_pivot = df.pivot_table(
         
    index=['job_country','job_title_short'],       
    aggfunc='size'                 
)
df_pivot.head(10)

job_country  job_title_short
Afghanistan  Business Analyst              4
             Data Analyst                  9
             Data Scientist                1
             Senior Data Analyst           2
Albania      Business Analyst             11
             Cloud Engineer                1
             Data Analyst                 36
             Data Engineer                30
             Data Scientist               12
             Machine Learning Engineer     4
dtype: int64

---

## üü® Salary Stats by Job Title (2.4.2)

In [16]:
df_new = df.pivot_table(
    values='salary_year_avg',        # The data to aggregate
    index='company_name',             # Rows (index of pivot table)       
    aggfunc=['mean', 'max', 'min']                 # Aggregation function
)

df_new

,mean,max,min
,salary_year_avg,salary_year_avg,salary_year_avg
company_name,,,
#twiceasnice Recruiting,77750.000000,120000.000000,61000.000000
/dev/color,125000.000000,125000.000000,125000.000000
0nward Select,92500.000000,92500.000000,92500.000000
1 Point System,137290.484375,137290.484375,137290.484375
1 Point System LLC.,170000.000000,170000.000000,170000.000000
...,...,...,...
zooplus SE,161750.000000,166000.000000,157500.000000
ztp,95000.000000,95000.000000,95000.000000
–õ–ê–ù–ò–¢,400000.000000,400000.000000,400000.000000
–¢–µ—Ö–Ω–æ–ª–æ–≥–∏—á–µ—Å–∫–∞—è –∫–æ–º–ø–∞–Ω–∏—è,280000.000000,280000.000000,280000.000000
‚ÄãIllinois State Board of Education,62536.000000,62536.000000,62536.000000

---

## üü• Sum Salary by Title and Country (2.4.3)

In [22]:
df_pivot = df[df['job_title_short'] == 'Data Scientist'].pivot_table(
    values='salary_year_avg',        # The data to aggregate
    index=['company_name', 'job_country'],            # Rows (index of pivot table)       
    aggfunc='median'                 # Aggregation function
)

df_pivot_filtered = df_pivot[df_pivot['salary_year_avg'] > 200000]

df_pivot_filtered.head(10)

                                   salary_year_avg
company_name        job_country
ACT                 Sudan                 225000.0
                    United States         225000.0
Abbott              United States         204000.0
Airbnb              United States         212500.0
Airtable            Sudan                 215500.0
                    United States         233500.0
Algo Capital Group  Sudan                 325000.0
                    United States         350000.0
Amadeus Search      United States         232500.0
Analog Devices, Inc United States         375000.0

---